# LineSegment Class (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
LineSegment Class
Members See Also
---
An output node that represents a tessellated line segment.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class LineSegment : IDisposable
```

Visual Basic
---
```text
Public Class LineSegment _
	Implements IDisposable
```

Visual C++
---
```text
public ref class LineSegment : IDisposable
```

# Remarks
See also: OnLineSegment(LineSegment).
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..LineSegment
# See Also
LineSegment Members
Autodesk.Revit.DB Namespace